# DuplicatePoints Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures..::..DuplicatePoints Property
BuiltInFailures..::..OverlapFailures Class See Also
---
There are identical points in the same place. Lines created from points may not work as expected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuplicatePoints { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuplicatePoints As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuplicatePoints {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OverlapFailures Class
Autodesk.Revit.DB Namespace